#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation. 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dailydesk/Production-CD/runs/run-KD6h43w8b7GgWv8a

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
heroku_app.app: Refreshing state... [id=9cd928bd-6be1-4e21-a90c-80832ed2966b]
heroku_addon.database: Refreshing state... [id=3252bc96-2fc2-4811-874d-080cdbc5002d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_build.deploy will be created
  + resource "heroku_build" "deploy" {
      + app_id            = "9cd928bd-6be1-4e21-a90c-80832ed2966b"
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-nodejs",
        ]
      + id                = (known after apply)
      + local_checksum    = "SHA256:680db2eb784ec5444be7932cadbe552fd7302f777e4ce963a95b02aa7a26bcca"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "."
        }
    }

  # heroku_formation.machine_config will be created
  + resource "heroku_formation" "machine_config" {
      + app_id   = "9cd928bd-6be1-4e21-a90c-80832ed2966b"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @KiranGopalakrishnan, Action: `pull_request`*